//Операторы сравнения

/*
Больше/меньше: a > b, a < b.
Больше/меньше или равно: a >= b, a <= b.
Равно: a == b. Обратите внимание, для сравнения используется двойной знак равенства ==.
Один знак равенства a = b означал бы присваивание.
Не равно. В математике обозначается символом ≠, но в JavaScript записывается как a != b.
*/

//Все операторы сравнения возвращают значение логического типа:
//true,false

alert(2 > 1);//true
alert(2 == 1);//false
alert(2 != 1);// true

let result = 5 > 4;
alert(result);//true

